`use strict`

class Movie {
  constructor(options) {
    this.title = options.title;
    this.image = options.image;
    this.date = options.date;
    this.info = options.info;
    this.actors = options.actors;
  }

  addToFavorite() {
    favorite.add(this)
  }

  removeFromFavorite() {
    favorite.delete(this)
  }
}

let favorite = new Set();
let movie1917 = new Movie({
  title: "1917",
  image: "https://upload.wikimedia.org/wikipedia/ru/e/ef/1917_%28%D1%84%D0%B8%D0%BB%D1%8C%D0%BC%29.jpeg",
  date: "4 декабря 2019 года",
  info: "6 апреля 1917 года, когда в мире бушует Первая мировая война, двое юных солдат получают опасное задание. Капралу Скофилду и капралу Блэйку предстоит осуществить миссию, которая остановит гибель более тысячи солдат. Парням необходимо пройти по вражеской территории и остаться незамеченными, чтобы передать засекреченное сообщение второму батальону об отмене наступления до начала атаки, иначе батальон попадет в засаду и тысяча шестьсот солдат погибнут. Если приказ не будет доставлен вовремя — начнется бессмысленная бойня. ",
  actors: ["Джордж Маккей", "Дин-Чарльз Чапман", "Бенедикт Камбербэтч", "Колин Ферт"]
});
let agentEva = new Movie({
  title: "Агент Ева",
  image: "https://upload.wikimedia.org/wikipedia/ru/3/3a/AvaPoster.jpg",
  date: "20 августа 2020 года",
  info: "Многие годы тайный агент Ева работает наемной убийцей и с большим профессионализмом выполняет свои обязанности. Умная и красивая девушка была завербована одной крупной компанией, а также прошла серьезную подготовку. За годы работы она отточила свои навыки, но стала неуправляемой, что вызывает беспокойство среди руководства компании. Особенно руководство тревожит то, что агент Ева разговаривает с объектами перед тем, как убить их. Поэтому было принято решение избавиться от Евы. Бизнес есть бизнес и бывший агент оказывается мишенью. Но Ева не намерена сдаваться поэтому ведет борьбу за собственную жизнь.",
  actors: ["Джессика Честейн", "Колин Фаррелл", "Джина Дэвис", "Джон Малкович"]
});
let greenland = new Movie({
  title: "Гренландия",
  image: "https://upload.wikimedia.org/wikipedia/ru/d/df/Greenland_%28film%29.jpg",
  date: "14 августа 2020 года",
  info: "Молодая семейная пара живет тихой семейной жизнью, пока однажды по телевиденью не сообщают, что огромная комета приближается к Земле. Это значит, что конец света близко и планета скоро будет уничтожена. Но выясняется, что надежда на спасение есть, для этого всего лишь надо попасть в бункер, находящийся на далеких берегах Гренландии. Главный герой Джон, его жена и маленький сын вынуждены отправиться в это опасное путешествие ради спасения своих жизней. Но путь окажется не из легких, им предстоит столкнуться с разрушениями связанными с кометой и всеобщей паникой, ведь во время мировой катастрофы каждый сам за себя и никто не придерживается человеческих законов.",
  actors: ["Джерард Батлер", "Морена Баккарин", "Скотт Гленн", "Дэвид Денман"]
});
let archive = new Movie({
  title: "Мой создатель",
  image: "https://upload.wikimedia.org/wikipedia/ru/b/be/%D0%9C%D0%BE%D0%B9_%D1%81%D0%BE%D0%B7%D0%B4%D0%B0%D1%82%D0%B5%D0%BB%D1%8C_%28%D1%84%D0%B8%D0%BB%D1%8C%D0%BC%2C_2020%29.jpg",
  date: "10 июля 2020 года",
  info: "В центре сюжета фильма находится Джордж Алмор, исследователь, занимающийся изучением и совершенствованием искусственного интеллекта. За окном 2046 год, настала эпоха технологий, развивающихся с удивительной скоростью, непостижимой человеческому пониманию. Основная работа Джорджа – сделать так, чтобы сильные мира сего раз и навсегда забыли о таком явлении, как смерть. Однако Алмор втайне от всех ведёт и другую работу – он хочет воскресить свою жену, которая скончалась несколько лет тому назад. Как-то раз заказчики теряют контакт с исследователем, а затем, недолго думая, отправляют в секретную лабораторию особый отряд, который должен будет выяснить истинные причины произошедшего в стенах подземелья…",
  actors: ["Тео Джеймс", "Стэйси Мартин"]
});
let terminator = new Movie({
  title: "Терминатор 6",
  image: "https://upload.wikimedia.org/wikipedia/ru/1/15/Terminator_6_first_poster.jpg",
  date: "1 ноября 2019 года",
  info: "Ещё недавно Дэни Рамос была совершенно обычной девочкой-подростком. Однако теперь она – символ предстоящей борьбы людей с машины. Символ, который находится в смертельной опасности, ведь SkyNet, суперкомпьютер будущего, отправил в прошлое улучшенную версию Терминатора. Это сверхсильный робот-убийца, перед которым стоит задача любыми способами убить Дэни и её окружение. К счастью, у героини фильма «Терминатор: Темные судьбы» есть защитница – девушка по имени Грейс, также прибывшая из будущего. Она представляет собой гибрид человека и машины. При всём это она даже не подозревает, что является киборгом, считая себя обычным человеком. Но даже она не может противостоять Терминатору модели Rev-9, состоящему из специального сплава, позволяющего ему разделяться на два автономных и полностью функциональных модуля. В ходе очередной схватки парочка, которую также сопровождает старший брат Дэни, оказывается в шаге от гибели. К их счастью, рядом появляется Сара Коннор – мать предводителя сопротивления из будущего, которая последние 27 лет занимается поиском враждебных Терминаторов. Вычисляя роботов, она уничтожает их, отсрочивая таким образом Судный день. Но и её помощи будет недостаточно, что вынудит героев обратиться за помощью к легендарному Терминатору Т-800, защищавшему когда-то сына Сары…",
  actors: ["Линда Хэмилтон", "Маккензи Дэвис", "Арнольд Шварценеггер", "Гэбриел Луна"]
});
let mandalorian = new Movie({
  title: "Мандалорец",
  image: "https://upload.wikimedia.org/wikipedia/ru/e/e6/The_Mandalorian_Poster.jpg",
  date: "12 ноября 2019 года",
  info: "Перед нами история из безграничной вселенной «Звездных войн», рассказывающая об охотнике за головами, живущем на самом краю Галактики. Не смотря на законы Новой Республики, здесь успешно существует влиятельная Гильдия, где Мандалорец и берёт задания по поиску или ликвидации беглецов. Браться за очередное задание герой отказывается из-за его дешевизны, после чего представитель Гильдии сводит его с таинственным заказчиком, обещающим неплохие деньги за достаточно простое, учитывая опыт Мандалорца, поручение. Ему предстоит отправиться на другую планету, чтобы уничтожить одного человека. Но прибыв на место, герой понимает, что всё гораздо сложнее, ведь ему необходимо убить ребёнка… Выполнит ли он заказ или сделает выбор, способный полностью разрушить его жизнь?",
  actors: ["Педро Паскаль", "Кайл Пацек", "Брендан Уэйн"]
});
let movies = [movie1917, agentEva, greenland, archive, terminator, mandalorian];